#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/initialised-si/JoWe-Web/runs/run-mMhYi9dPpsGJEUNr

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...
module.web.aws_cloudfront_origin_access_identity.jowe_web: Refreshing state... [id=E5VWR9I7KGZSJ]
module.web.aws_s3_bucket.jowe_web: Refreshing state... [id=jowe.initialised.si]
module.web.aws_s3_bucket_ownership_controls.jowe_web: Refreshing state... [id=jowe.initialised.si]
module.web.aws_s3_bucket_public_access_block.jowe_web: Refreshing state... [id=jowe.initialised.si]
module.web.aws_s3_bucket_versioning.jowe_web: Refreshing state... [id=jowe.initialised.si]
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refreshing...
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refresh complete after 0s [id=1920302536]
module.web.aws_s3_bucket_policy.jowe_web: Refreshing state... [id=jowe.initialised.si]
module.web.aws_cloudfront_distribution.jowe_web: Refreshing state... [id=E3PO6D275Y4WSU]
module.web.aws_s3_bucket_acl.jowe_web: Refreshing state... [id=jowe.initialised.si,private]
module.web.aws_s3_object.upload_webapp["static/js/main.10040337.js.map"]: Refreshing state... [id=static/js/main.10040337.js.map]
module.web.aws_s3_object.upload_webapp["static/css/main.f04d7010.css"]: Refreshing state... [id=static/css/main.f04d7010.css]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg"]: Refreshing state... [id=static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg]
module.web.aws_s3_object.upload_webapp["static/js/726.e869980a.chunk.js"]: Refreshing state... [id=static/js/726.e869980a.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/915.2b20329f.chunk.js"]: Refreshing state... [id=static/js/915.2b20329f.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/915.35ba84bd.chunk.css"]: Refreshing state... [id=static/css/915.35ba84bd.chunk.css]
module.web.aws_s3_object.upload_webapp["static/css/main.f04d7010.css.map"]: Refreshing state... [id=static/css/main.f04d7010.css.map]
module.web.aws_s3_object.upload_webapp["asset-manifest.json"]: Refreshing state... [id=asset-manifest.json]
module.web.aws_s3_object.upload_webapp["static/js/777.3fc69ada.chunk.js.map"]: Refreshing state... [id=static/js/777.3fc69ada.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css"]: Refreshing state... [id=static/css/777.872b5878.chunk.css]
module.web.aws_s3_object.upload_webapp["static/js/106.74767f96.chunk.js.map"]: Refreshing state... [id=static/js/106.74767f96.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/496.099941b1.chunk.js"]: Refreshing state... [id=static/js/496.099941b1.chunk.js]
module.web.aws_s3_object.upload_webapp["manifest.json"]: Refreshing state... [id=manifest.json]
module.web.aws_s3_object.upload_webapp["static/js/726.e869980a.chunk.js.map"]: Refreshing state... [id=static/js/726.e869980a.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css.map"]: Refreshing state... [id=static/css/777.872b5878.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/js/924.d545cbce.chunk.js"]: Refreshing state... [id=static/js/924.d545cbce.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/356.2a621892.chunk.js.LICENSE.txt"]: Refreshing state... [id=static/js/356.2a621892.chunk.js.LICENSE.txt]
module.web.aws_s3_object.upload_webapp["static/js/106.74767f96.chunk.js"]: Refreshing state... [id=static/js/106.74767f96.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css"]: Refreshing state... [id=static/css/106.872b5878.chunk.css]
module.web.aws_s3_object.upload_webapp["favicon.ico"]: Refreshing state... [id=favicon.ico]
module.web.aws_s3_object.upload_webapp["static/js/main.10040337.js.LICENSE.txt"]: Refreshing state... [id=static/js/main.10040337.js.LICENSE.txt]
module.web.aws_s3_object.upload_webapp["static/js/356.2a621892.chunk.js"]: Refreshing state... [id=static/js/356.2a621892.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/496.099941b1.chunk.js.map"]: Refreshing state... [id=static/js/496.099941b1.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/777.3fc69ada.chunk.js"]: Refreshing state... [id=static/js/777.3fc69ada.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js.map"]: Refreshing state... [id=static/js/698.1c688865.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css.map"]: Refreshing state... [id=static/css/106.872b5878.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js"]: Refreshing state... [id=static/js/698.1c688865.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/main.10040337.js"]: Refreshing state... [id=static/js/main.10040337.js]
module.web.aws_s3_object.upload_webapp["static/js/924.d545cbce.chunk.js.map"]: Refreshing state... [id=static/js/924.d545cbce.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/356.2a621892.chunk.js.map"]: Refreshing state... [id=static/js/356.2a621892.chunk.js.map]
module.web.aws_s3_object.upload_webapp["index.html"]: Refreshing state... [id=index.html]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-female.9d832d02f50e90f40bbe.jpg"]: Refreshing state... [id=static/media/anonymous-female.9d832d02f50e90f40bbe.jpg]
module.web.aws_s3_object.upload_webapp["static/js/915.2b20329f.chunk.js.map"]: Refreshing state... [id=static/js/915.2b20329f.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/915.35ba84bd.chunk.css.map"]: Refreshing state... [id=static/css/915.35ba84bd.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/css/main.f04d7010.css"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/css/915.35ba84bd.chunk.css.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/915.2b20329f.chunk.js"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/106.74767f96.chunk.js.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/777.3fc69ada.chunk.js"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/css/915.35ba84bd.chunk.css"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.10040337.js.LICENSE.txt"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.10040337.js"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.10040337.js.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/777.3fc69ada.chunk.js.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/106.74767f96.chunk.js"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/915.2b20329f.chunk.js.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/css/main.f04d7010.css.map"]: Drift detected (update)
module.web.aws_cloudfront_origin_access_identity.jowe_web: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.web.aws_s3_object.upload_webapp["asset-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "7b9774dcd506042abcd449e0ab073251" -> "6755a628ac8edcc93549b499c0ac566e"
        id                     = "asset-manifest.json"
        tags                   = {}
      ~ version_id             = "16by4NEtzhoSbU_5f71uBVRweHRHs1kb" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "4df837c8763915b1c92a0bcc4c5f707a" -> "c8b9327b0d07120899e6d897b09574d8"
        id                     = "index.html"
        tags                   = {}
      ~ version_id             = ".iZxL6s2W1i95.uWKAZFxqheQT4z7hSS" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/356.2a621892.chunk.js"] will be destroyed
  # (because key ["static/js/356.2a621892.chunk.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "ef6782c086a55a0a63e0a304e0055c55" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/356.2a621892.chunk.js" -> null
      - key                    = "static/js/356.2a621892.chunk.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/356.2a621892.chunk.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "RW25XG_XA5lIWuTV_vDUdgLOdk9ea8mz" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/356.2a621892.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/356.2a621892.chunk.js.LICENSE.txt"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/plain; charset=utf-8" -> null
      - etag                   = "686f404fb6748c84bd90802c573b89fc" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/356.2a621892.chunk.js.LICENSE.txt" -> null
      - key                    = "static/js/356.2a621892.chunk.js.LICENSE.txt" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/356.2a621892.chunk.js.LICENSE.txt" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "zKm2JwixfgLTV3WUsgP6IiSQiH3js_1W" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/356.2a621892.chunk.js.map"] will be destroyed
  # (because key ["static/js/356.2a621892.chunk.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "0f0217397a9622b6778117239bc40c9d" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/356.2a621892.chunk.js.map" -> null
      - key                    = "static/js/356.2a621892.chunk.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/356.2a621892.chunk.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "o7Sa.L.CzFrFCqhxiZsYZdE82F5UdpvG" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/356.ab45c9e7.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "09ca10f1dfcd96f757c65beb386b72a9"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/356.ab45c9e7.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/356.ab45c9e7.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/356.ab45c9e7.chunk.js.LICENSE.txt"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = "686f404fb6748c84bd90802c573b89fc"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/356.ab45c9e7.chunk.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/356.ab45c9e7.chunk.js.LICENSE.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/356.ab45c9e7.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "f48c12b57f9f00e32637422c8eac9091"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/356.ab45c9e7.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/356.ab45c9e7.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.10040337.js"] will be destroyed
  # (because key ["static/js/main.10040337.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "8e73f3b9dd5bc1c5c5fe21bf7f489c61" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.10040337.js" -> null
      - key                    = "static/js/main.10040337.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.10040337.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "j_3EnbawVXzaSwJS7wQtt6rXePedLO0Q" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.10040337.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/main.10040337.js.LICENSE.txt"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/plain; charset=utf-8" -> null
      - etag                   = "9851f1b8c0c24b33f9a190b2a8d11b66" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.10040337.js.LICENSE.txt" -> null
      - key                    = "static/js/main.10040337.js.LICENSE.txt" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.10040337.js.LICENSE.txt" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "Tjyja42QhqhPS5A7FXUqm7.0LLUgwFSd" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.10040337.js.map"] will be destroyed
  # (because key ["static/js/main.10040337.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "94959264082ca3b408782a7bd1547ca4" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.10040337.js.map" -> null
      - key                    = "static/js/main.10040337.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.10040337.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "7c3K5Chfazl8wD6OTaWuvEGOs87vFE8i" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.3cf38676.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "350976bcd7e20a1926540ea7efdc0bb9"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.3cf38676.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.3cf38676.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.3cf38676.js.LICENSE.txt"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = "63c7e8c8c109e59cec81dd0832390f86"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.3cf38676.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.3cf38676.js.LICENSE.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.3cf38676.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "30f22cc6134553b2572477cc492f4ed1"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.3cf38676.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.3cf38676.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 6 to add, 2 to change, 6 to destroy.

```

</details>

*Pushed by: @Andrej988, Action: `pull_request`*